import 'dart:collection';
import 'dart:ffi';

int getChapterNumbers(){

  var chaptersMap = new HashMap();
  

  List<String> chapters =[
    "باب الإخلاص وإحضار النية"
    ,"باب التوبة"
    ,"باب الصبر"
    ,"باب الصدق"
    ,"باب المراقبة"
    ,"باب التقوى"
    ,"باب اليقين والتوكل"
    ,"باب الاستقامة"
    ,"باب التفكير في عظيم مخلوقات الله"
    ,"باب المبادرة إلى الخيرات"
    ,"باب المجاهدة"
    ,"باب الحث على الازدياد من الخير في أواخر العمر"
    ,"باب بيان كثرة طرق الخير"
    ,"باب الاقتصاد في الطاعة"
    ,"باب المحافظة على الأعمال"
    ,"باب الأمر بالمحافظة على السنة وآدابها"
    ,"باب وجوب الانقياد لحكـم الله تعالى"
    ,"باب النهي عن البدع ومحدثات الأمور"
    ,"باب فيمن سّن سنة حسنة أو سيئة"
    ,"باب الدلالة على خير والدعاء إلى هدى أو ضلالة"
    ,"باب التعاون على البر والتقوى"
    ,"باب النصيحة"
    ,"باب الأمر بالمعروف والنهي عن المنكر"
    ,"باب تغليظ عقوبة من أمر بمعروف أو نهى عن منكر وخالف قوله فعله"
    ,"باب الأمر بأداء الأمانة"
    ,"باب تحريم الظلم والأمر برد المظالم"
    ,"باب تعظيم حرمات المسلمين وبيان حقوقهم والشفقة عليهم ورحمتهم"
    ,"باب ستر عورات المسلمين والنهي عن إشاعتها لغير ضرورة"
    ,"باب قضاء حوائج المسلمين"
    ,"باب الشفاعة"
    ,"باب الإصلاح بين الناس"
    ,"باب فضل ضعفة المسلمين"
    ,"باب ملاطفة اليتيم والبنات"
    ,"باب الوصية بالنساء"
    ,"باب حق الزوج على المرأة"
    ,"باب النفقة على العيال"
    ,"باب الإنفاق مما يحب ومن الجيد"
    ,"باب وجوب أمر أهله وأولاده بطاعة الله تعالى"
    ,"باب حق الجار و الوصية به"
    ,"باب بر الوالدين و صلة الأرحام"
    ,"باب تحريم العقوق و قطيعة الرحم"
    ,"باب بر أصدقاء الأب و الأم و الأقارب و الزوجة"
    ,"باب إكرام أهل بيت رسول الله و بيان فضلهم"
    ,"باب توقيرالعلماءوالكبار وأهل الفضل"
    ,"باب زيارةأهل الخير و مجالستهم و صحبتهم و محبتهم و طلب زيارتهم و الدعاء منهم و زيارة المواضع الفاضلة"
    ,"باب فضل الحب في الله والحث عليه ، وإعلام الرجل من يحبه أنه يحبه , وماذا يقول له إذا أعلمه"
    ,"باب علامات حب الله تعالى للعبد والحث على التخلق بها، والسعي في تحصيلها"
    ,"باب التحذير من إيذاء الصالحين والضعفة والمساكين"
    ,"باب إجراء أحكام الناس على الظاهر وسرائرهم إلى الله تعالى"
    ,"باب الخوف"
    ,"باب الرجاء"
    ,"باب فضل الرجاء"
    ,"باب الجمع بين الخوف والرجاء"
    ,"باب فضل البكاء من خشية الله تعالى وشوقا إليه"
    ,"باب فضل الزهد في الدنيا والحث على التقلل منها وفضل الفقر"
    ,"باب فضل الجوع وخشونة العيش والاقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات"
    ,"باب القناعة والعفاف والاقتصاد في المعيشة والإنفاق وذم السؤال من غير ضرورة"
    ,"باب جواز الأخذ من غير مسألة ولاتطلع إليه"
    ,"باب الحث على الأكل من عمل يده والتعفف به عن السؤال والتعرض للإعطاء"
    ,"باب الكرم والجود والإنفاق في وجوه الخير ثقة بالله تعالى"
    ,"باب النهي عن البخل والشح"
    ,"باب الإيثار والمواساة"
    ,"باب التنافس في أمور الآخرة والاستكثار مما يتبرك به"
    ,"باب فضل الغني الشاكر وهو من أخذ المال من وجهه وصرفه في وجوهه المأمور بها"
    ,"باب ذكر الموت وقصر الأمل"
    ,"باب استحباب زيارة القبور للرجال وما يقوله الزائر"
    ,"باب كراهية تمني الموت بسبب ضٍر نزل به ، ولا بأس به لخوف الفتنة في الدين"
    ,"باب الورع وترك الشبهات"
    ,"باب استحباب العزلة عند فساد الناس والزمان أو الخوف من فتنة في الدين أو وقوع في حرام وشبهات ونحوها"
    ,"باب فضل الاختلاط بالناس وحضور جمعهم وجماعاتهم"
    ,"باب التواضع وخفض الجناح للمؤمنين"
    ,"باب تحريم الكبر والإعجاب"
    ,"باب حسن الُخُلِق"
    ,"باب الحلم والأناة والرفق"
    ,"باب العفو والإعراض عن الجاهلين"
    ,"باب احتمال الأذى"
    ,"باب ْالغضب إذا انتهكت حرمات الشرع والانتصار لدين الله تعالى"
    ,"باب أمر ولاة الأمور بالرفق برعاياهم ونصيحتهم"
    ,"باب الوالي العادل"
    ,"باب وجوب طاعة ولاة الأمور في غير معصية وتحريم طاعتهم في المعصية"
    ,"باب النهي عن سؤال الإمارة واختيار ترك الولايات إذا لم يتعين عليه أو تدع حاجة إليه"
    ,"باب حث السلطان والقاضي وغيرهما من ولاة الأمور على اتخاذ وزير صالح"
    ,"باب النهي عن تولية الإمارة والقضاء وغيرهما من الولايات لمن سألها أو حرص عليها"
    ,"باب الحياء وفضله والحث على التخـلق به"
    ,"باب حفظ السر"
    ,"باب الوفاء بالعهد وإنجاز الوعد"
    ,"باب الأمر بالمحافظة على ما اعتاده من الخير"
    ,"باب استحباب طيب الكلام وطلاقة الوجه عند اللقاء"
    ,"باب استحباب بيان الكلام وإيضاحه للمخاطب"
    ,"باب إصغاء الجليس لحديث جليسه"
    ,"باب الوعظ والاقتصاد فيه"
    ,"باب الوقار والسكينة"
    ,"باب الندب إلى إتيان الصلاة والعلم ونحوهما بالسكينة والوقار"
    ,"باب إكرام الضيف"
    ,"باب استحباب التبشير والتهنئة بالخير"
    ,"باب وداع الصاحب ووصيته عند فراقه"
    ,"باب الاستخارة والمشاورة"
    ,"باب استحباب الذهاب إلى العيد وعيادة المريض"
    ,"باب استحباب تقديم اليمين في كل ما هو من  ,باب التكريم"
    ,"باب التسمية في أوله والحمد في آخره"
    ,"باب لا يعيب الطعام واستحباب مدحه"
    ,"باب ما يقوله من حضر الطعام وهو صائم إذا لم يفطر"
    ,"باب ما يقوله من دعي إلى الطعام فتبعه غيره"
    ,"باب الأكل مما يليه  َو َوعظه وتأديبه من يسيء أكله"
    ,"باب النهي عن القران بين تمرتين ونحوهما إلا بإذن"
    ,"باب ما يقوله ويفعله من يأكل ولا يشبع"
    ,"باب الأمر بالأكل من جًانب القصعة"
    ,"باب كراهية الأكل متكئا"
    ,"باب استحباب الأكل بثلاث أصابع"
    ,"باب تكثير الأيدي على الطعام"
    ,"باب أدب الشرب واستحباب التنفس ثلاثًا"
    ,"باب كراهة الشرب من فم القربة ونحوها"
    ,"باب كراهة النفخ في الشراب"
    ,"باب بيان جواز الشرب قائمًا وبيان أن الأكمل الشرب قاعدًا"
    ,"باب استحباب كون ساقي القوم آخرهم شربًا"
    ,"باب جواز الشرب من جميع الأواني الطاهرة"
    ,"باب استحباب الثوب الأبيض وجواز الأحمر"
    ,"باب استحباب القميص"
    ,"باب صفة طول القميص والكم والإزار"
    ,"باب استحباب ترك الترفع في اللباس تواضعًا"
    ,"باب استحباب التوسط في اللباس"
    ,"باب تحريم لباس الحرير على الرجال"
    ,"باب جواز لبس الحرير لمن به حكة"
    ,"باب النهي عن افتراش جلود النمور والركوب عليها"
    ,"باب ما يقول إذا لبس ثوبًا جديدًا"
    ,"باب استحباب الابتداء باليمين في اللباس"
    ,"باب آداب النوم والاضطجاع"
    ,"باب جواز الاستلقاء على القفا"
    ,"باب آداب المجلس والجليس"
    ,"باب الرؤيا ومايتعلق بها"
    ,"باب فضل السلام والأمر بإفشائه"
    ,"باب كيفية السلام"
    ,"باب آداب السلام"
    ,"باب استحباب إعادة السلام على من تكرر لقاؤه"
    ,"باب استحباب السلام إذا دخل بيته"
    ,"باب السلام على الصبيان"
    ,"باب سلام الرجل على زوجته والمرأة من محارمه"
    ,"باب تحريم ابتداء الكافر بالسلام وكيفية الرد عليهم"
    ,"باب استحباب السلام إذا قام من المجلس وفارق جلساءه"
    ,"باب الاستئذان وآدابه"
    ,"باب بيان أن السنة إذا قيل للمستأذن من أنت أن يقول: فلان"
    ,"باب استحباب تشميت العاطس إذا حمد الله تعالى"
    ,"باب استحباب المصافحة عند اللقاء وبشاشة الوجه"
    ,"باب عيادة المريض"
    ,"باب ما يدعى به للمريض"
    ,"باب استحباب سؤال أهل المريض عن حاله"
    ,"باب ما يقوله من أيس من حياته"
    ,"باب استحباب وصية أهل المريض"
    ,"باب جواز قول المريض: أنا وجع أو شديد الوجـع"
    ,"باب تلقين المحتضر: لا الله إلا الله"
    ,"باب ما يقوله بعد تغميض الميت"
    ,"باب ما يقال عند الميت وما يقوله من مات له ميت"
    ,"باب جواز البكاء على الميت بغير ندب ولانياحة"
    ,"باب الكف عما يرى في الميت من مكروه"
    ,"باب الصلاة على الميت وتشييعه"
    ,"باب استحباب تكثير المصلين على الجنازة"
    ,"باب ما يقرأ في صلاة الجنازة"
    ,"باب الإسراع بالجنازة"
    ,"باب تعجيل قضاء الدين عن الميت"
    ,"باب الموعظة عند القبر"
    ,"باب الدعاء للميت بعد دفنه والقعود عند قبره"
    ,"باب الصدقة عن الميت والدعاء له"
    ,"باب ثناء الناس على الميت"
    ,"باب فضل من مات له أولاد صغار"
    ,"باب البكاء والخوف عند المرور بقبور الظالمين"
    ,"باب استحباب الخروج يوم الخميس أول النهار"
    ,"باب استحباب طلب الرفقة وتأميرهم على أنفسهم واحدا"
    ,"باب آداب السير والنزول والمبيت والنوم في السفر"
    ,"باب إعانة الرفيق"
    ,"باب ما يقول إذا ركب الدابة للسفر"
    ,"باب تكبير المسافر إذا صعد الثنايا وشبهها"
    ,"باب استحباب الدعاء في السفر"
    ,"باب ما يدعو به إذا خاف ًناسًا أو غيرهم"
    ,"باب ما يقول إذا نزل منزلا"
    ,"باب استحباب تعجيل المسافر الرجوٍع  إلى أهله"
    ,"باب استحباب القدوم على أهله نهارا وكراهته في الليل"
    ,"باب ما يقوله إذا رجع وإذا رأى بلدته"
    ,"باب استحباب ابتداء القادم بالمسجد"
    ,"باب تحريم سفر المرأة وحدها"
    ,"باب فضل قراءة القرآن"
    ,"باب الأمر بتعهد القرَان والتحذير من تعريضه للنسيان"
    ,"باب استحباب تحسين الصوت بالقرآن وطلب القراءة من حسن الصوت"
    ,"باب في الحث على سور وآيات مخصوصة"
    ,"باب استحباب الاجتماع على القراءة"
    ,"باب فضل الوضوء"
    ,"باب فضل الأذان"
    ,"باب فضل الصلوات"
    ,"باب فضل صلاة الصبح والعصر"
    ,"باب فضل المشي إلى المساجد"
    ,"باب فضل انتظار الصلاة"
    ,"باب فضل صلاة الجماعة"
    ,"باب الحث على حضور الجماعة في الصبح والعشاء"
    ,"باب الأمر بالمحافظة على الصلوات المكتوبات"
    ,"باب فضل الصف الأول"
    ,"باب فضل السنن الراتبة مع الفرائض"
    ,"باب تأكيد ركعتي سنة الصبح"
    ,"باب تخفيف ركعتي الفجر وبيان ما يقرأ فيهما"
    ,"باب استحباب الاضطجاع بعد ركعتي الفجر على جنبه الأيمن"
    ,"باب سنة الظهر"
    ,"باب سنة العصر"
    ,"باب سنة المغرب : بعدها وقبلها"
    ,"باب سنة العشاء: بعدها وقبلها"
    ,"باب سنة الجمعة"
    ,"باب استحباب جعل النوافل في البيت"
    ,"باب الحث على صلاة الوتر"
    ,"باب فضل صلاة الضحى"
    ,"باب تجويز صلاة الضحى من ارتفاع الشمس إلى زوالها"
    ,"باب الحث على صلاة تحية المسجد ركـعتين"
    ,"باب استحباب ركعتين بعد الوضوء"
    ,"باب فضل يوم الجمعة ووجوبها والاغتسال لها"
    ,"باب استحباب سجود الشكر"
    ,"باب فضل قيام الليل"
    ,"باب استحباب قيام رمضان ، وهو التراويح"
    ,"باب فضل قيام ليلة القدر"
    ,"باب فضل السواك وخصال الفطرة"
    ,"باب تأكيد وجوب الزكاة وبيان فضلها"
    ,"باب وجوب صوم رمضان وبيان فضل الصيام وما يتعلق به"
    ,"باب الجود وفعل المعروف والإكثار من الخير في شهر رمضان"
    ,"باب النهي عن تقدم رمضان بصوم بعد نصف شعبان"
    ,"باب ما يقال عند رؤية الهلال"
    ,"باب فضل السحور وتأخيره ما لم يخش طلوع الفجر"
    ,"باب فضل تعجيل الفطر"
    ,"باب أمر الصائم بحفظ لسانه وجوارحه"
    ,"باب في مسائل من الصوم"
    ,"باب بيان فضل صوم المحَّرم وشعبان والأشهر الحرم"
    ,"باب فضل الصوم وغيره في العشر الأول من ذي الحجة"
    ,"باب فضل صوم يوم عرفة وعاشوراء وتاسوعاء"
    ,"باب استحباب صوم ستة أيام من شوال"
    ,"باب استحباب صوم يوم الاثنين والخميس"
    ,"باباستحباب صوم ثلاثة أيام من كل شهر"
    ,"باب فضل من فطر صائمًا"
    ,"باب فضل الاعتكاف"
    ,"باب وجوب الحج"
    ,"باب فضل الجهاد"
    ,"باب بيان جماعة من الشهداء في ثواب الآخرة"
    ,"باب فضل العتق"
    ,"باب فضل الإحسان إلى المملوك"
    ,"باب فضل المملوك الذي يؤدي حق الله وحق مواليه"
    ,"باب فضل العبادة في الهرج وهو الاختلاط والفتن ونحوها"
    ,"باب فضل السماحة في البيع والشراء، والأخذ والعطاء"
    ,"باب فضل العلم"
    ,"باب فضل الحمد والشكر"
    ,"باب فضل الصلاة على رسول الله"
    ,"باب فضل الذكر والحث عليه"
    ,"باب ذكر الله تعالى قائمًا وقاعدًا ومضطجعاً"
    ,"باب ما يقوله عند نومه واستيقاظه"
    ,"باب فضل ِحَلْق الذكر"
    ,"باب الذكر عند الصباح والمساء"
    ,"باب ما يقوله عند النوم"
    ,"باب فضل الدعاء"
    ,"باب فضل الدعاء بظهر الغيب"
    ,"باب في مسائل من الدعاء"
    ,"باب كرامات الأولياء وفضلهم"
    ,"باب تحريم الغيبة والأمر بحفظ اللسان"
    ,"باب تحريم سماع الغيبة"
    ,"باب مايباح من الغيبة"
    ,"باب تحريم النميمة"
    ,"باب النهي عن نقل الحديث وكلام الناس"
    ,"باب ذم ذي الوجهين"
    ,"باب تحريم الكذب"
    ,"باب بيان ما يجوز من الكذب"
    ,"باب الحث على التثُّبت فيما يقوله ويحكيه"
    ,"باب بيان غلظ تحريم شهادة الزور"
    ,"باب تحريم لعن إنسان بعينه أو دابة"
    ,"باب جواز لعن أصحاب المعاصي غير المعينين"
    ,"باب تحريم سب المسلم بغير حق"
    ,"باب تحريم سب الأموات بغير حق"
    ,"باب النهي عن الإيذاء"
    ,"باب النهي عن التباغض والتقاطع والتدابر"
    ,"باب تحريم الحسد"
    ,"باب النهي عن التجسس والتسمع لكلام من يكره استماعه"
    ,"باب النهي عن سوء الظن"
    ,"باب تحريم احتقار المسلمين"
    ,"باب النهي عن إظهار الشماتة بالمسلم"
    ,"باب تحريم الطعن في الأنساب"
    ,"باب النهي عن الغش والخداع"
    ,"باب تحريم الغدر"
    ,"باب النهي عن المّن بالعطية ونحوها"
    ,"باب النهي عن الافتخار والبغي"
    ,"باب تحريم الهجران بين المسلمين فوق ثلاثة أيام"
    ,"باب النهي عن تناجي اثنين دون الثالث بغير إذنه"
    ,"باب النهي عن تعذيب العبد والدابة والمرأة"
    ,"باب تحريم التعذيب بالنار في كل حيوان"
    ,"باب تحريم مطل الغني بحٍّق طلبه صاحبه"
    ,"باب كراهة عودة الإنسان في هبة لم يسلمها إلى الموهوب له"
    ,"باب تأكيد تحريم مال اليتيم"
    ,"باب تغليظ تحريم الربا"
    ,"باب تحريم الرياء"
    ,"باب ما يتوهم أنه رياء وليس هو رياء"
    ,"باب تحريم النظر إلى المرأة الأجنبية"
    ,"باب تحريم الخلوة بالأجنبية"
    ,"باب تحريم تشبه الرجال بالنساء"
    ,"باب النهي عن التشبه بالشيطان والكفار"
    ,"باب نهي الرجل والمرأة عن خضاب شعرهما بسواد"
    ,"باب النهي عن القزع وهو حلق بعض الرأس دون بعض"
    ,"باب تحريم وصل الشعر والوشم"
    ,"باب النهي عن نتف الشيب من اللحية والرأس وغيرهما"
    ,"باب كراهية الاستنجاء باليمين ومس الفرج باليمين من غير عذر"
    ,"باب كراهية المشي في نعل واحدة"
    ,"باب النهي عن ترك النار في البيت عند النوم"
    ,"باب النهي عن التكلف"
    ,"باب تحريم النياح َه على الميت ولطم الخد"
    ,"باب النهي عن إتيان الكهان والمنجمين"
    ,"باب النهي عن التطير"
    ,"باب تحريم تصوير الحيوان في بساط"
    ,"باب تحريم اتخاذ الكلب إّلا لصيد"
    ,"باب كرهة تعليق الجرس في البعير وغيره"
    ,"باب كراهة ركوب الجلالة"
    ,"باب النهي عن البصاق في المسجد"
    ,"باب كراهية الخصومة في المسجد ورفع الصوت فيه"
    ,"باب نهي من أكل ثومًا أو بصلا أو كراثً"
    ,"باب كراهة الاحتباء يوم الجمعة والإمام يخطب"
    ,"باب نهي من دخل عليه عشر ذي الحجة وأراد أن يضحي عن أخذ شيء من شعره"
    ,"باب النهي عن الحلف بمخلوق كالنبي والكعبة"
    ,"باب تغليظ اليمين الكاذبة عمدً",
    " باب ندب من حلف على يمين فرأى غيرها خيرًا منها"
    ,"باب العفو عن لغو اليمين"
    ,"باب كراهة الحلف في البيع وإن كانّ صادقًا"
    ,"باب كراهة أن يسأل الإنسان بوجه الله غير الجنة"
    ,"باب تحريم قول شاهنشاه للسلطان وغيره"
    ,"باب النهي عن مخاطبة الفاسق والمبتدع ونحوهما بسيد ونحوه"
    ,"باب كراهة سب الحّمى"
    ,"باب النهي عن سب الريح"
    ,"باب كراهة سب الديك"
    ,"باب النهي عن قول الإنسان: مطرنا بنوء كذا"
    ,"باب تحريم قوله لمسلم: ياكافر"
    ,"باب النهي عن الفحش وبذاء اللسان"
    ,"باب كراهة التقعير في الكلام والتشدق"
    ,"باب كراهة قوله: خبثت نفسي"
    ,"باب كراهة تسمية العنب كرمًا"
    ,"باب النهي عن وصف محاسن المرأة لرجل"
    ,"باب كراهة قول الإنسان: اللهم اغفر لي إن شئت"
    ,"باب كراهة قول: ماشاء الله وشاء فلان"
    ,"باب كراهة الحديث بعد العشاء الآخرة"
    ,"باب تحريم امتناع المرأة من فرًاش زوجها"
    ,"باب تحريم صوم المرأة تطوعا وزوجها حاضر إلا بإذنه"
    ,"باب تحريم رفع المأموم رأسه من الركوع أو السجود قبل الإمام"
    ,"باب كراهة وضع اليد على الخاصرة في الصلاة"
    ,"باب كراهة الصلاة بحضرة الطعام"
    ,"باب النهي عن رفع البصر إلى السماء في الصلاة"
    ,"باب كراهة الالتفات في الصلاة لغير عذر"
    ,"باب النهي عن الصلاة إلى القبور"
    ,"باب تحريم المرور بين يدي المصلي"
    ,"باب كراهة شروع المأموم في نافلة"
    ,"باب كراهة تخصيص يوم الجمعة بصيام أو ليلته بصلاة من بين الليالي"
    ,"باب تحريم الوصال في الصوم"
    ,"باب تحريم الجلوس على قبر"
    ,"باب النهى عن تجصيص القبر والبناء عليه"
    ,"باب تغليظ تحريم إباق العبد من سيده"
    ,"باب تحريم الشفاعة في الحدود"
    ,"باب النهي عن التغوط في طريق الناس"
    ,"باب النهي عن البول ونحوه في الماء الراكد"
    ,"باب كراهة تفضيل الوالد بعض أولاده"
    ,"باب تحريم إحداد المرأة على ميت فوق ثلاثة أيام إلا على زوجها أربعة أشهر وعشرة أيام"
    ,"باب تحريم بيع الحاضر للبادي"
    ,"باب النهي عن إضاعة المال في غير وجوهه"
    ,"باب النهي عن الإشارة إلى مسلم بسلاح ونحوه"
    ,"باب كراهة الخروج من المسجد بعد الأذان"
    ,"باب كراهة رد الريحان لغير عذر"
    ,"باب كراهة المدح في الوجـه لمن خيف عليه مفسدة"
    ,"باب كراهة الخروج من بلد وقع فيها البلاء"
    ,"باب التغليظ في تحريم السحر"
    ,"باب النهي عن المسافرة بالمصحف إلى بلاد الكفار"
    ,"باب تحريم استعمال إناء الذهب وإناء الفضة"
    ,"باب تحريم لبس الرجل ثوبًا مزعفرًا"
    ,"باب النهي عن صمت يوم إلى الليل"
    ,"باب تحريم انتساب الإنسان إلى غير أبيه"
    ,"باب التحذير من ارتكاب ما نهى الله أو رسوله عنه"
    ,"باب ما يقوله ويفعله من ارتكب منهيًا عنه"
    ,"باب المنثورات والملح"
    ,"باب الاستغفار"
    ,"باب ما أعد الله تعالى للمؤمنين في الجنة"
  ];
  return chapters.length;



}


List<String> getChapterName() {
  List<String> chapters =[
    "باب الإخلاص وإحضار النية"
    ,"باب التوبة"
    ,"باب الصبر"
    ,"باب الصدق"
    ,"باب المراقبة"
    ,"باب التقوى"
    ,"باب اليقين والتوكل"
    ,"باب الاستقامة"
    ,"باب التفكير في عظيم مخلوقات الله"
    ,"باب المبادرة إلى الخيرات"
    ,"باب المجاهدة"
    ,"باب الحث على الازدياد من الخير في أواخر العمر"
    ,"باب بيان كثرة طرق الخير"
    ,"باب الاقتصاد في الطاعة"
    ,"باب المحافظة على الأعمال"
    ,"باب الأمر بالمحافظة على السنة وآدابها"
    ,"باب وجوب الانقياد لحكـم الله تعالى"
    ,"باب النهي عن البدع ومحدثات الأمور"
    ,"باب فيمن سّن سنة حسنة أو سيئة"
    ,"باب الدلالة على خير والدعاء إلى هدى أو ضلالة"
    ,"باب التعاون على البر والتقوى"
    ,"باب النصيحة"
    ,"باب الأمر بالمعروف والنهي عن المنكر"
    ,"باب تغليظ عقوبة من أمر بمعروف أو نهى عن منكر وخالف قوله فعله"
    ,"باب الأمر بأداء الأمانة"
    ,"باب تحريم الظلم والأمر برد المظالم"
    ,"باب تعظيم حرمات المسلمين وبيان حقوقهم والشفقة عليهم ورحمتهم"
    ,"باب ستر عورات المسلمين والنهي عن إشاعتها لغير ضرورة"
    ,"باب قضاء حوائج المسلمين"
    ,"باب الشفاعة"
    ,"باب الإصلاح بين الناس"
    ,"باب فضل ضعفة المسلمين"
    ,"باب ملاطفة اليتيم والبنات"
    ,"باب الوصية بالنساء"
    ,"باب حق الزوج على المرأة"
    ,"باب النفقة على العيال"
    ,"باب الإنفاق مما يحب ومن الجيد"
    ,"باب وجوب أمر أهله وأولاده بطاعة الله تعالى"
    ,"باب حق الجار و الوصية به"
    ,"باب بر الوالدين و صلة الأرحام"
    ,"باب تحريم العقوق و قطيعة الرحم"
    ,"باب بر أصدقاء الأب و الأم و الأقارب و الزوجة"
    ,"باب إكرام أهل بيت رسول الله و بيان فضلهم"
    ,"باب توقيرالعلماءوالكبار وأهل الفضل"
    ,"باب زيارةأهل الخير و مجالستهم و صحبتهم و محبتهم و طلب زيارتهم و الدعاء منهم و زيارة المواضع الفاضلة"
    ,"باب فضل الحب في الله والحث عليه ، وإعلام الرجل من يحبه أنه يحبه , وماذا يقول له إذا أعلمه"
    ,"باب علامات حب الله تعالى للعبد والحث على التخلق بها، والسعي في تحصيلها"
    ,"باب التحذير من إيذاء الصالحين والضعفة والمساكين"
    ,"باب إجراء أحكام الناس على الظاهر وسرائرهم إلى الله تعالى"
    ,"باب الخوف"
    ,"باب الرجاء"
    ,"باب فضل الرجاء"
    ,"باب الجمع بين الخوف والرجاء"
    ,"باب فضل البكاء من خشية الله تعالى وشوقا إليه"
    ,"باب فضل الزهد في الدنيا والحث على التقلل منها وفضل الفقر"
    ,"باب فضل الجوع وخشونة العيش والاقتصار على القليل من المأكول والمشروب والملبوس وغيرها من حظوظ النفس وترك الشهوات"
    ,"باب القناعة والعفاف والاقتصاد في المعيشة والإنفاق وذم السؤال من غير ضرورة"
    ,"باب جواز الأخذ من غير مسألة ولاتطلع إليه"
    ,"باب الحث على الأكل من عمل يده والتعفف به عن السؤال والتعرض للإعطاء"
    ,"باب الكرم والجود والإنفاق في وجوه الخير ثقة بالله تعالى"
    ,"باب النهي عن البخل والشح"
    ,"باب الإيثار والمواساة"
    ,"باب التنافس في أمور الآخرة والاستكثار مما يتبرك به"
    ,"باب فضل الغني الشاكر وهو من أخذ المال من وجهه وصرفه في وجوهه المأمور بها"
    ,"باب ذكر الموت وقصر الأمل"
    ,"باب استحباب زيارة القبور للرجال وما يقوله الزائر"
    ,"باب كراهية تمني الموت بسبب ضٍر نزل به ، ولا بأس به لخوف الفتنة في الدين"
    ,"باب الورع وترك الشبهات"
    ,"باب استحباب العزلة عند فساد الناس والزمان أو الخوف من فتنة في الدين أو وقوع في حرام وشبهات ونحوها"
    ,"باب فضل الاختلاط بالناس وحضور جمعهم وجماعاتهم"
    ,"باب التواضع وخفض الجناح للمؤمنين"
    ,"باب تحريم الكبر والإعجاب"
    ,"باب حسن الُخُلِق"
    ,"باب الحلم والأناة والرفق"
    ,"باب العفو والإعراض عن الجاهلين"
    ,"باب احتمال الأذى"
    ,"باب ْالغضب إذا انتهكت حرمات الشرع والانتصار لدين الله تعالى"
    ,"باب أمر ولاة الأمور بالرفق برعاياهم ونصيحتهم"
    ,"باب الوالي العادل"
    ,"باب وجوب طاعة ولاة الأمور في غير معصية وتحريم طاعتهم في المعصية"
    ,"باب النهي عن سؤال الإمارة واختيار ترك الولايات إذا لم يتعين عليه أو تدع حاجة إليه"
    ,"باب حث السلطان والقاضي وغيرهما من ولاة الأمور على اتخاذ وزير صالح"
    ,"باب النهي عن تولية الإمارة والقضاء وغيرهما من الولايات لمن سألها أو حرص عليها"
    ,"باب الحياء وفضله والحث على التخـلق به"
    ,"باب حفظ السر"
    ,"باب الوفاء بالعهد وإنجاز الوعد"
    ,"باب الأمر بالمحافظة على ما اعتاده من الخير"
    ,"باب استحباب طيب الكلام وطلاقة الوجه عند اللقاء"
    ,"باب استحباب بيان الكلام وإيضاحه للمخاطب"
    ,"باب إصغاء الجليس لحديث جليسه"
    ,"باب الوعظ والاقتصاد فيه"
    ,"باب الوقار والسكينة"
    ,"باب الندب إلى إتيان الصلاة والعلم ونحوهما بالسكينة والوقار"
    ,"باب إكرام الضيف"
    ,"باب استحباب التبشير والتهنئة بالخير"
    ,"باب وداع الصاحب ووصيته عند فراقه"
    ,"باب الاستخارة والمشاورة"
    ,"باب استحباب الذهاب إلى العيد وعيادة المريض"
    ,"باب استحباب تقديم اليمين في كل ما هو من  ,باب التكريم"
    ,"باب التسمية في أوله والحمد في آخره"
    ,"باب لا يعيب الطعام واستحباب مدحه"
    ,"باب ما يقوله من حضر الطعام وهو صائم إذا لم يفطر"
    ,"باب ما يقوله من دعي إلى الطعام فتبعه غيره"
    ,"باب الأكل مما يليه  َو َوعظه وتأديبه من يسيء أكله"
    ,"باب النهي عن القران بين تمرتين ونحوهما إلا بإذن"
    ,"باب ما يقوله ويفعله من يأكل ولا يشبع"
    ,"باب الأمر بالأكل من جًانب القصعة"
    ,"باب كراهية الأكل متكئا"
    ,"باب استحباب الأكل بثلاث أصابع"
    ,"باب تكثير الأيدي على الطعام"
    ,"باب أدب الشرب واستحباب التنفس ثلاثًا"
    ,"باب كراهة الشرب من فم القربة ونحوها"
    ,"باب كراهة النفخ في الشراب"
    ,"باب بيان جواز الشرب قائمًا وبيان أن الأكمل الشرب قاعدًا"
    ,"باب استحباب كون ساقي القوم آخرهم شربًا"
    ,"باب جواز الشرب من جميع الأواني الطاهرة"
    ,"باب استحباب الثوب الأبيض وجواز الأحمر"
    ,"باب استحباب القميص"
    ,"باب صفة طول القميص والكم والإزار"
    ,"باب استحباب ترك الترفع في اللباس تواضعًا"
    ,"باب استحباب التوسط في اللباس"
    ,"باب تحريم لباس الحرير على الرجال"
    ,"باب جواز لبس الحرير لمن به حكة"
    ,"باب النهي عن افتراش جلود النمور والركوب عليها"
    ,"باب ما يقول إذا لبس ثوبًا جديدًا"
    ,"باب استحباب الابتداء باليمين في اللباس"
    ,"باب آداب النوم والاضطجاع"
    ,"باب جواز الاستلقاء على القفا"
    ,"باب آداب المجلس والجليس"
    ,"باب الرؤيا ومايتعلق بها"
    ,"باب فضل السلام والأمر بإفشائه"
    ,"باب كيفية السلام"
    ,"باب آداب السلام"
    ,"باب استحباب إعادة السلام على من تكرر لقاؤه"
    ,"باب استحباب السلام إذا دخل بيته"
    ,"باب السلام على الصبيان"
    ,"باب سلام الرجل على زوجته والمرأة من محارمه"
    ,"باب تحريم ابتداء الكافر بالسلام وكيفية الرد عليهم"
    ,"باب استحباب السلام إذا قام من المجلس وفارق جلساءه"
    ,"باب الاستئذان وآدابه"
    ,"باب بيان أن السنة إذا قيل للمستأذن من أنت أن يقول: فلان"
    ,"باب استحباب تشميت العاطس إذا حمد الله تعالى"
    ,"باب استحباب المصافحة عند اللقاء وبشاشة الوجه"
    ,"باب عيادة المريض"
    ,"باب ما يدعى به للمريض"
    ,"باب استحباب سؤال أهل المريض عن حاله"
    ,"باب ما يقوله من أيس من حياته"
    ,"باب استحباب وصية أهل المريض"
    ,"باب جواز قول المريض: أنا وجع أو شديد الوجـع"
    ,"باب تلقين المحتضر: لا الله إلا الله"
    ,"باب ما يقوله بعد تغميض الميت"
    ,"باب ما يقال عند الميت وما يقوله من مات له ميت"
    ,"باب جواز البكاء على الميت بغير ندب ولانياحة"
    ,"باب الكف عما يرى في الميت من مكروه"
    ,"باب الصلاة على الميت وتشييعه"
    ,"باب استحباب تكثير المصلين على الجنازة"
    ,"باب ما يقرأ في صلاة الجنازة"
    ,"باب الإسراع بالجنازة"
    ,"باب تعجيل قضاء الدين عن الميت"
    ,"باب الموعظة عند القبر"
    ,"باب الدعاء للميت بعد دفنه والقعود عند قبره"
    ,"باب الصدقة عن الميت والدعاء له"
    ,"باب ثناء الناس على الميت"
    ,"باب فضل من مات له أولاد صغار"
    ,"باب البكاء والخوف عند المرور بقبور الظالمين"
    ,"باب استحباب الخروج يوم الخميس أول النهار"
    ,"باب استحباب طلب الرفقة وتأميرهم على أنفسهم واحدا"
    ,"باب آداب السير والنزول والمبيت والنوم في السفر"
    ,"باب إعانة الرفيق"
    ,"باب ما يقول إذا ركب الدابة للسفر"
    ,"باب تكبير المسافر إذا صعد الثنايا وشبهها"
    ,"باب استحباب الدعاء في السفر"
    ,"باب ما يدعو به إذا خاف ًناسًا أو غيرهم"
    ,"باب ما يقول إذا نزل منزلا"
    ,"باب استحباب تعجيل المسافر الرجوٍع  إلى أهله"
    ,"باب استحباب القدوم على أهله نهارا وكراهته في الليل"
    ,"باب ما يقوله إذا رجع وإذا رأى بلدته"
    ,"باب استحباب ابتداء القادم بالمسجد"
    ,"باب تحريم سفر المرأة وحدها"
    ,"باب فضل قراءة القرآن"
    ,"باب الأمر بتعهد القرَان والتحذير من تعريضه للنسيان"
    ,"باب استحباب تحسين الصوت بالقرآن وطلب القراءة من حسن الصوت"
    ,"باب في الحث على سور وآيات مخصوصة"
    ,"باب استحباب الاجتماع على القراءة"
    ,"باب فضل الوضوء"
    ,"باب فضل الأذان"
    ,"باب فضل الصلوات"
    ,"باب فضل صلاة الصبح والعصر"
    ,"باب فضل المشي إلى المساجد"
    ,"باب فضل انتظار الصلاة"
    ,"باب فضل صلاة الجماعة"
    ,"باب الحث على حضور الجماعة في الصبح والعشاء"
    ,"باب الأمر بالمحافظة على الصلوات المكتوبات"
    ,"باب فضل الصف الأول"
    ,"باب فضل السنن الراتبة مع الفرائض"
    ,"باب تأكيد ركعتي سنة الصبح"
    ,"باب تخفيف ركعتي الفجر وبيان ما يقرأ فيهما"
    ,"باب استحباب الاضطجاع بعد ركعتي الفجر على جنبه الأيمن"
    ,"باب سنة الظهر"
    ,"باب سنة العصر"
    ,"باب سنة المغرب : بعدها وقبلها"
    ,"باب سنة العشاء: بعدها وقبلها"
    ,"باب سنة الجمعة"
    ,"باب استحباب جعل النوافل في البيت"
    ,"باب الحث على صلاة الوتر"
    ,"باب فضل صلاة الضحى"
    ,"باب تجويز صلاة الضحى من ارتفاع الشمس إلى زوالها"
    ,"باب الحث على صلاة تحية المسجد ركـعتين"
    ,"باب استحباب ركعتين بعد الوضوء"
    ,"باب فضل يوم الجمعة ووجوبها والاغتسال لها"
    ,"باب استحباب سجود الشكر"
    ,"باب فضل قيام الليل"
    ,"باب استحباب قيام رمضان ، وهو التراويح"
    ,"باب فضل قيام ليلة القدر"
    ,"باب فضل السواك وخصال الفطرة"
    ,"باب تأكيد وجوب الزكاة وبيان فضلها"
    ,"باب وجوب صوم رمضان وبيان فضل الصيام وما يتعلق به"
    ,"باب الجود وفعل المعروف والإكثار من الخير في شهر رمضان"
    ,"باب النهي عن تقدم رمضان بصوم بعد نصف شعبان"
    ,"باب ما يقال عند رؤية الهلال"
    ,"باب فضل السحور وتأخيره ما لم يخش طلوع الفجر"
    ,"باب فضل تعجيل الفطر"
    ,"باب أمر الصائم بحفظ لسانه وجوارحه"
    ,"باب في مسائل من الصوم"
    ,"باب بيان فضل صوم المحَّرم وشعبان والأشهر الحرم"
    ,"باب فضل الصوم وغيره في العشر الأول من ذي الحجة"
    ,"باب فضل صوم يوم عرفة وعاشوراء وتاسوعاء"
    ,"باب استحباب صوم ستة أيام من شوال"
    ,"باب استحباب صوم يوم الاثنين والخميس"
    ,"باباستحباب صوم ثلاثة أيام من كل شهر"
    ,"باب فضل من فطر صائمًا"
    ,"باب فضل الاعتكاف"
    ,"باب وجوب الحج"
    ,"باب فضل الجهاد"
    ,"باب بيان جماعة من الشهداء في ثواب الآخرة"
    ,"باب فضل العتق"
    ,"باب فضل الإحسان إلى المملوك"
    ,"باب فضل المملوك الذي يؤدي حق الله وحق مواليه"
    ,"باب فضل العبادة في الهرج وهو الاختلاط والفتن ونحوها"
    ,"باب فضل السماحة في البيع والشراء، والأخذ والعطاء"
    ,"باب فضل العلم"
    ,"باب فضل الحمد والشكر"
    ,"باب فضل الصلاة على رسول الله"
    ,"باب فضل الذكر والحث عليه"
    ,"باب ذكر الله تعالى قائمًا وقاعدًا ومضطجعاً"
    ,"باب ما يقوله عند نومه واستيقاظه"
    ,"باب فضل ِحَلْق الذكر"
    ,"باب الذكر عند الصباح والمساء"
    ,"باب ما يقوله عند النوم"
    ,"باب فضل الدعاء"
    ,"باب فضل الدعاء بظهر الغيب"
    ,"باب في مسائل من الدعاء"
    ,"باب كرامات الأولياء وفضلهم"
    ,"باب تحريم الغيبة والأمر بحفظ اللسان"
    ,"باب تحريم سماع الغيبة"
    ,"باب مايباح من الغيبة"
    ,"باب تحريم النميمة"
    ,"باب النهي عن نقل الحديث وكلام الناس"
    ,"باب ذم ذي الوجهين"
    ,"باب تحريم الكذب"
    ,"باب بيان ما يجوز من الكذب"
    ,"باب الحث على التثُّبت فيما يقوله ويحكيه"
    ,"باب بيان غلظ تحريم شهادة الزور"
    ,"باب تحريم لعن إنسان بعينه أو دابة"
    ,"باب جواز لعن أصحاب المعاصي غير المعينين"
    ,"باب تحريم سب المسلم بغير حق"
    ,"باب تحريم سب الأموات بغير حق"
    ,"باب النهي عن الإيذاء"
    ,"باب النهي عن التباغض والتقاطع والتدابر"
    ,"باب تحريم الحسد"
    ,"باب النهي عن التجسس والتسمع لكلام من يكره استماعه"
    ,"باب النهي عن سوء الظن"
    ,"باب تحريم احتقار المسلمين"
    ,"باب النهي عن إظهار الشماتة بالمسلم"
    ,"باب تحريم الطعن في الأنساب"
    ,"باب النهي عن الغش والخداع"
    ,"باب تحريم الغدر"
    ,"باب النهي عن المّن بالعطية ونحوها"
    ,"باب النهي عن الافتخار والبغي"
    ,"باب تحريم الهجران بين المسلمين فوق ثلاثة أيام"
    ,"باب النهي عن تناجي اثنين دون الثالث بغير إذنه"
    ,"باب النهي عن تعذيب العبد والدابة والمرأة"
    ,"باب تحريم التعذيب بالنار في كل حيوان"
    ,"باب تحريم مطل الغني بحٍّق طلبه صاحبه"
    ,"باب كراهة عودة الإنسان في هبة لم يسلمها إلى الموهوب له"
    ,"باب تأكيد تحريم مال اليتيم"
    ,"باب تغليظ تحريم الربا"
    ,"باب تحريم الرياء"
    ,"باب ما يتوهم أنه رياء وليس هو رياء"
    ,"باب تحريم النظر إلى المرأة الأجنبية"
    ,"باب تحريم الخلوة بالأجنبية"
    ,"باب تحريم تشبه الرجال بالنساء"
    ,"باب النهي عن التشبه بالشيطان والكفار"
    ,"باب نهي الرجل والمرأة عن خضاب شعرهما بسواد"
    ,"باب النهي عن القزع وهو حلق بعض الرأس دون بعض"
    ,"باب تحريم وصل الشعر والوشم"
    ,"باب النهي عن نتف الشيب من اللحية والرأس وغيرهما"
    ,"باب كراهية الاستنجاء باليمين ومس الفرج باليمين من غير عذر"
    ,"باب كراهية المشي في نعل واحدة"
    ,"باب النهي عن ترك النار في البيت عند النوم"
    ,"باب النهي عن التكلف"
    ,"باب تحريم النياح َه على الميت ولطم الخد"
    ,"باب النهي عن إتيان الكهان والمنجمين"
    ,"باب النهي عن التطير"
    ,"باب تحريم تصوير الحيوان في بساط"
    ,"باب تحريم اتخاذ الكلب إّلا لصيد"
    ,"باب كرهة تعليق الجرس في البعير وغيره"
    ,"باب كراهة ركوب الجلالة"
    ,"باب النهي عن البصاق في المسجد"
    ,"باب كراهية الخصومة في المسجد ورفع الصوت فيه"
    ,"باب نهي من أكل ثومًا أو بصلا أو كراثً"
    ,"باب كراهة الاحتباء يوم الجمعة والإمام يخطب"
    ,"باب نهي من دخل عليه عشر ذي الحجة وأراد أن يضحي عن أخذ شيء من شعره"
    ,"باب النهي عن الحلف بمخلوق كالنبي والكعبة"
    ,"باب تغليظ اليمين الكاذبة عمدً",
    " باب ندب من حلف على يمين فرأى غيرها خيرًا منها"
    ,"باب العفو عن لغو اليمين"
    ,"باب كراهة الحلف في البيع وإن كانّ صادقًا"
    ,"باب كراهة أن يسأل الإنسان بوجه الله غير الجنة"
    ,"باب تحريم قول شاهنشاه للسلطان وغيره"
    ,"باب النهي عن مخاطبة الفاسق والمبتدع ونحوهما بسيد ونحوه"
    ,"باب كراهة سب الحّمى"
    ,"باب النهي عن سب الريح"
    ,"باب كراهة سب الديك"
    ,"باب النهي عن قول الإنسان: مطرنا بنوء كذا"
    ,"باب تحريم قوله لمسلم: ياكافر"
    ,"باب النهي عن الفحش وبذاء اللسان"
    ,"باب كراهة التقعير في الكلام والتشدق"
    ,"باب كراهة قوله: خبثت نفسي"
    ,"باب كراهة تسمية العنب كرمًا"
    ,"باب النهي عن وصف محاسن المرأة لرجل"
    ,"باب كراهة قول الإنسان: اللهم اغفر لي إن شئت"
    ,"باب كراهة قول: ماشاء الله وشاء فلان"
    ,"باب كراهة الحديث بعد العشاء الآخرة"
    ,"باب تحريم امتناع المرأة من فرًاش زوجها"
    ,"باب تحريم صوم المرأة تطوعا وزوجها حاضر إلا بإذنه"
    ,"باب تحريم رفع المأموم رأسه من الركوع أو السجود قبل الإمام"
    ,"باب كراهة وضع اليد على الخاصرة في الصلاة"
    ,"باب كراهة الصلاة بحضرة الطعام"
    ,"باب النهي عن رفع البصر إلى السماء في الصلاة"
    ,"باب كراهة الالتفات في الصلاة لغير عذر"
    ,"باب النهي عن الصلاة إلى القبور"
    ,"باب تحريم المرور بين يدي المصلي"
    ,"باب كراهة شروع المأموم في نافلة"
    ,"باب كراهة تخصيص يوم الجمعة بصيام أو ليلته بصلاة من بين الليالي"
    ,"باب تحريم الوصال في الصوم"
    ,"باب تحريم الجلوس على قبر"
    ,"باب النهى عن تجصيص القبر والبناء عليه"
    ,"باب تغليظ تحريم إباق العبد من سيده"
    ,"باب تحريم الشفاعة في الحدود"
    ,"باب النهي عن التغوط في طريق الناس"
    ,"باب النهي عن البول ونحوه في الماء الراكد"
    ,"باب كراهة تفضيل الوالد بعض أولاده"
    ,"باب تحريم إحداد المرأة على ميت فوق ثلاثة أيام إلا على زوجها أربعة أشهر وعشرة أيام"
    ,"باب تحريم بيع الحاضر للبادي"
    ,"باب النهي عن إضاعة المال في غير وجوهه"
    ,"باب النهي عن الإشارة إلى مسلم بسلاح ونحوه"
    ,"باب كراهة الخروج من المسجد بعد الأذان"
    ,"باب كراهة رد الريحان لغير عذر"
    ,"باب كراهة المدح في الوجـه لمن خيف عليه مفسدة"
    ,"باب كراهة الخروج من بلد وقع فيها البلاء"
    ,"باب التغليظ في تحريم السحر"
    ,"باب النهي عن المسافرة بالمصحف إلى بلاد الكفار"
    ,"باب تحريم استعمال إناء الذهب وإناء الفضة"
    ,"باب تحريم لبس الرجل ثوبًا مزعفرًا"
    ,"باب النهي عن صمت يوم إلى الليل"
    ,"باب تحريم انتساب الإنسان إلى غير أبيه"
    ,"باب التحذير من ارتكاب ما نهى الله أو رسوله عنه"
    ,"باب ما يقوله ويفعله من ارتكب منهيًا عنه"
    ,"باب المنثورات والملح"
    ,"باب الاستغفار"
    ,"باب ما أعد الله تعالى للمؤمنين في الجنة"
  ];
  return chapters;
}

int getPageNumbers(int index){

  List<int> chapters =[
    25
    ,37
    ,55
    ,72
    ,85
    ,92
    ,97
    ,111
    ,115
    ,121
    ,123
    ,134
    ,136
    ,145
    ,164
    ,164
    ,175
    ,177
    ,187
    ,188
    ,197
    ,200
    ,200
    ,209
    ,209
    ,216
    ,224
    ,227
    ,227
    ,239
    ,239
    ,241
    ,243
    ,248
    ,261
    ,270
    ,271
    ,272
    ,284
    ,288
    ,298
    ,301
    ,303
    ,305
    ,310
    ,314
    ,329
    ,330
    ,330
    ,332
    ,343
    ,354
    ,354
    ,356
    ,361
    ,372
    ,383
    ,391
    ,391
    ,397
    ,407
    ,414
    ,419
    ,419
    ,427
    ,432
    ,433
    ,433
    ,440
    ,454
    ,457
    ,463
    ,475
    ,484
    ,494
    ,499
    ,499
    ,506
    ,507
    ,508
    ,520
    ,520
    ,521
    ,529
    ,534
    ,538
    ,540
    ,541
    ,541
    ,546
    ,546
    ,549
    ,551
    ,554
    ,554
    ,557
    ,558
    ,568
    ,568
    ,577
    ,578
    ,578
    ,578
    ,578
    ,579
    ,579
    ,579
    ,579
    ,580
    ,581
    ,581
    ,582
    ,582
    ,582
    ,583
    ,583
    ,584
    ,586
    ,586
    ,588
    ,589
    ,589
    ,589
    ,590
    ,590
    ,590
    ,590
    ,591
    ,592
    ,599
    ,600
    ,601
    ,602
    ,603
    ,603
    ,603
    ,603
    ,603
    ,603
    ,605
    ,605
    ,606
    ,607
    ,609
    ,612
    ,613
    ,613
    ,614
    ,614
    ,614
    ,615
    ,615
    ,616
    ,616
    ,617
    ,617
    ,618
    ,619
    ,621
    ,621
    ,621
    ,622
    ,622
    ,622
    ,623
    ,632
    ,632
    ,633
    ,635
    ,635
    ,636
    ,637
    ,638
    ,638
    ,638
    ,638
    ,639
    ,639
    ,639
    ,639
    ,645
    ,648
    ,648
    ,658
    ,662
    ,677
    ,678
    ,703
    ,704
    ,705
    ,706
    ,708
    ,709
    ,710
    ,712
    ,712
    ,713
    ,714
    ,714
    ,715
    ,715
    ,716
    ,716
    ,716
    ,717
    ,718
    ,718
    ,719
    ,719
    ,720
    ,722
    ,723
    ,729
    ,729
    ,730
    ,731
    ,734
    ,738
    ,739
    ,739
    ,739
    ,740
    ,741
    ,741
    ,749
    ,750
    ,750
    ,750
    ,750
    ,751
    ,752
    ,752
    ,753
    ,763
    ,773
    ,782
    ,782
    ,782
    ,783
    ,783
    ,785
    ,815
    ,816
    ,820
    ,838
    ,838
    ,839
    ,840
    ,842
    ,844
    ,853
    ,853
    ,854
    ,860
    ,863
    ,863
    ,869
    ,873
    ,874
    ,876
    ,880
    ,881
    ,887
    ,888
    ,889
    ,890
    ,891
    ,891
    ,891
    ,892
    ,898
    ,900
    ,901
    ,904
    ,905
    ,905
    ,910
    ,912
    ,914
    ,916
    ,919
    ,920
    ,921
    ,922
    ,922
    ,923
    ,923
    ,924
    ,925
    ,939
    ,941
    ,941
    ,942
    ,943
    ,943
    ,945
    ,946
    ,947
    ,947
    ,947
    ,948
    ,950
    ,952
    ,953
    ,955
    ,956
    ,957
    ,957
    ,957
    ,958
    ,958
    ,959
    ,959
    ,959
    ,960
    ,961
    ,962
    ,962
    ,962
    ,963
    ,963
    ,963
    ,963
    ,964
    ,964
    ,964
    ,968
    ,971
    ,971
    ,971
    ,972
    ,972
    ,972
    ,972
    ,973
    ,973
    ,973
    ,973
    ,974
    ,974
    ,974
    ,974
    ,976
    ,976
    ,977
    ,977
    ,977
    ,977
    ,978
    ,978
    ,978
    ,979
    ,979
    ,979
    ,980
    ,981
    ,987
    ,987
    ,988
    ,988
    ,989
    ,990
    ,991
    ,991
    ,992
    ,992
    ,992
    ,993
    ,993
    ,994
    ,1012
    ,1019
  ];
  return chapters[index];



}


